base/Catalogs/бит_ТочкиАлгоритмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ТочкиАлгоритмов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_АлгоритмыПроцессов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТочки</Name>
					<Comment>Вид точки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыТочекАлгоритмов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскоеУсловие</Name>
					<Comment>Пользовательское условие</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскоеДействие</Name>
					<Comment>Пользовательское действие</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформлениеТочки</Name>
					<Comment>Оформление точки</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТочки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктивнаяТочкаМаршрута</Name>
					<Comment>Оптимизация</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскийВыборВарианта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеВыборыВарианта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящиеТочки</Name>
					<Comment>Входящие точки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Точка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ТочкиАлгоритмов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Comment>Направление</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_Направление</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеУсловия</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Точка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ТочкиАлгоритмов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Comment>Направление</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_Направление</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеУсловия</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрТип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыВыбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяВарианта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеВыбора</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_СпособыВыполненияАлгоритма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_СпособыВыполненияАлгоритма</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сразу</Name>
					<Comment>Полностью</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поэтапно</Name>
					<Comment>Поэтапно</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_ВидыТочекАлгоритмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыТочекАлгоритмов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
					<Comment>Старт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
					<Comment>Действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
					<Comment>Условие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
					<Comment>Разделение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
					<Comment>Слияние</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодчиненныйПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_ВидыАлгоритмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыАлгоритмов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусовОбъектов</Name>
					<Comment>Изменение статусов объектов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Визирование</Name>
					<Comment>Визирование</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_Направление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_Направление</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вертикаль</Name>
					<Comment>Вертикаль</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Горизонталь</Name>
					<Comment>Горизонталь</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_АлгоритмыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_АлгоритмыПроцессов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАлгоритма</Name>
					<Comment>Вид алгоритма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыАлгоритмов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыполнения</Name>
					<Comment>Способ выполнения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыВыполненияАлгоритма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение_УУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение_МУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение_Бюдж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаМаршрута</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыАлгоритма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрТип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Динамический</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_ТочкиАлгоритмов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыеПараметрыПроверкиЗаполнения() Экспорт
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ПроверятьЗацикливаниеПоВложеннойТаблице", Ложь);
	ПараметрыПроверки.Вставить("Ссылка", Справочники.бит_ТочкиАлгоритмов.ПустаяСсылка());
	ПараметрыПроверки.Вставить("ИсходящиеТочкиДляПроверкиЗацикливания",   Неопределено);
	Возврат ПараметрыПроверки;
	
КонецФункции

Процедура ПроверитьЗаполнение(РеквизитыТочки, Отказ, ПараметрыПроверки = Неопределено) Экспорт

	// 1 - несколько входящих,
	// 2 - несколько исходящих,
	// 3 - нет входящих,
	// 4 - нет исходящих,
	// 5 - неожиданные входящие точки,
	// 6 - неожиданные входящие точки,
	// 7 - точки обработки не поддерживаются алгоритмом.
	
	Если ПараметрыПроверки = Неопределено Тогда
		ПараметрыПроверки = НовыеПараметрыПроверкиЗаполнения();
	КонецЕсли;
	
	Ссылка 			  = РеквизитыТочки.Ссылка;
	Наименование 	  = РеквизитыТочки.Наименование;
	Владелец 		  = РеквизитыТочки.Владелец;
	ВидТочки 		  = РеквизитыТочки.ВидТочки;
	ВходящиеТочки 	  = РеквизитыТочки.ВходящиеТочки;
	ИсходящиеТочки 	  = РеквизитыТочки.ИсходящиеТочки;
	ПараметрыПроцесса = РеквизитыТочки.ПараметрыПроцесса;
	ВидАлгоритма      = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ВидАлгоритма");
	
	ЭтоПоэтапныйАлгоритм = (РеквизитыТочки.Владелец.СпособВыполнения = Перечисления.бит_СпособыВыполненияАлгоритма.Поэтапно);
	
	// Несколько входящих.
	Если ВидТочки <> Перечисления.бит_ВидыТочекАлгоритмов.Слияние
		И ВходящиеТочки.Количество() > 1
		И ВидАлгоритма <> Перечисления.бит_ВидыАлгоритмов.Прочее Тогда
		
		РазрешеныНесколькоВходищих = Ложь;
		Если ЭтоПоэтапныйАлгоритм Тогда
			Для каждого СтрокаИсходящейТочки Из ИсходящиеТочки Цикл
				Если ПараметрыПроверки.ПроверятьЗацикливаниеПоВложеннойТаблице Тогда
					Если ТочкиЗациклены(ПараметрыПроверки.Ссылка, СтрокаИсходящейТочки.Точка,
											ПараметрыПроверки.ИсходящиеТочкиДляПроверкиЗацикливания) Тогда
						РазрешеныНесколькоВходищих = Истина;
						Прервать;
					КонецЕсли;
				Иначе
					Если бит_УправлениеПроцессами.ТочкиЗациклены(Ссылка, СтрокаИсходящейТочки.Точка) Тогда
						РазрешеныНесколькоВходищих = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ РазрешеныНесколькоВходищих Тогда
			ТекстСообщения = ТекстОшибкиЗаполнения(Наименование, 1);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Владелец,,,Отказ); 
		КонецЕсли;
	КонецЕсли; 
	
	// Несколько исходящих.
	Если ВидТочки <> Перечисления.бит_ВидыТочекАлгоритмов.Разделение
		И ВидТочки <> Перечисления.бит_ВидыТочекАлгоритмов.ВыборВарианта
		И ИсходящиеТочки.Количество() > 1 Тогда
		Если ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Условие Тогда
			Если ИсходящиеТочки.Количество() > 2 Тогда
				ТекстСообщения = ТекстОшибкиЗаполнения(Наименование, 0, 
									НСтр("ru='Поддерживает только 2 связи.';en='Only supports 2 communication.'"));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Владелец,,,Отказ);
			КонецЕсли; 
		Иначе
			ТекстСообщения = ТекстОшибкиЗаполнения(Наименование, 2);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Владелец,,,Отказ);
		КонецЕсли;
	КонецЕсли; 
	
	// Нет входящих.
	Если ВидТочки <> Перечисления.бит_ВидыТочекАлгоритмов.Старт И ВходящиеТочки.Количество() = 0 Тогда
		ТекстСообщения = ТекстОшибкиЗаполнения(Наименование, 3);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Владелец,,,Отказ); 
	КонецЕсли; 
	
	// Нет исходящих.
	Если ВидТочки <> Перечисления.бит_ВидыТочекАлгоритмов.Завершение И ИсходящиеТочки.Количество() = 0 Тогда
		ТекстСообщения = ТекстОшибкиЗаполнения(Наименование, 4);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Владелец,,,Отказ); 
	КонецЕсли;
	
	// Неожиданные входящие точки.
	Если ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Старт И ВходящиеТочки.Количество() > 0 Тогда
		ТекстСообщения = ТекстОшибкиЗаполнения(Наименование, 5);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Владелец,,,Отказ); 
	КонецЕсли; 
	
	// Неожиданные входящие точки.
	Если ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Завершение И ИсходящиеТочки.Количество() > 0 Тогда
		ТекстСообщения = ТекстОшибкиЗаполнения(Наименование, 6);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Владелец,,,Отказ); 
	КонецЕсли;
	
	// Точки обработок в необрабатываемых алгоритмах.
	Если ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Обработка
		И ВидАлгоритма <> Перечисления.бит_ВидыАлгоритмов.Визирование Тогда
		ТекстСообщения = ТекстОшибкиЗаполнения(Наименование, 7);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Владелец,,,Отказ); 
	КонецЕсли;
	
	// Связи точки Условие.
	Если ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Условие Тогда
		Отбор = Новый Структура("Направление",Перечисления.бит_Направление.Вертикаль);
		Результат = ИсходящиеТочки.НайтиСтроки(Отбор);
		Если Результат.Количество() > 1 Тогда
			Пояснение = НСтр("ru='Несколько связей ""Да"".';en='Several links ""Yes.""'"); 
			ТекстСообщения = ТекстОшибкиЗаполнения(Наименование, 0, Пояснение);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Владелец,,,Отказ);
		КонецЕсли; 
		
		Отбор = Новый Структура("Направление",Перечисления.бит_Направление.Горизонталь);
		Результат = ИсходящиеТочки.НайтиСтроки(Отбор);
		Если Результат.Количество() > 1 Тогда
			Пояснение = НСтр("ru='Несколько связей ""Нет"".';en='Several links ""No"".'"); 
			ТекстСообщения = ТекстОшибкиЗаполнения(Наименование, 0, Пояснение);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Владелец,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	НовыйКэш = Новый Соответствие;
	Если ТипЗнч(РеквизитыТочки) = Тип("СправочникОбъект.бит_ТочкиАлгоритмов") Тогда
		КэшПройденныхТочек = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РеквизитыТочки.ДополнительныеСвойства,
													"КэшПройденныхТочек",
													НовыйКэш);
	Иначе
		КэшПройденныхТочек = НовыйКэш;
	КонецЕсли;
	
	Если НЕ ЭтоПоэтапныйАлгоритм Тогда
		// Проверка на зацикливание
		Для каждого СтрокаТаблицы Из ИсходящиеТочки Цикл
			Если СтрокаТаблицы.Точка.ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Слияние Тогда
				ПроверитьЗацикливаниеТочкиСлияния(СтрокаТаблицы.Точка, СтрокаТаблицы.Точка, Отказ, КэшПройденныхТочек);
				Если Отказ Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
		
	Если Справочники.бит_АлгоритмыПроцессов.ЕстьДинамическиеПараметры(Владелец) 
		 И ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Действие Тогда
		бит_УправлениеПроцессами.ПроверитьЗаполнениеПараметровПроцесса(ПараметрыПроцесса, Отказ);
	КонецЕсли;
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура ЗаполнитьЗначенияУсловийПриПереходеНаНовуюВерсию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВходящиеТочкиТочекАлгоритмов.Ссылка КАК ТочкаАлгоритма,
	|	""ВходящиеТочки"" КАК ТабличнаяЧасть,
	|	ВходящиеТочкиТочекАлгоритмов.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВходящиеТочкиТочекАлгоритмов.Направление = ЗНАЧЕНИЕ(Перечисление.бит_Направление.Горизонталь)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЗначениеУсловия,
	|	ВходящиеТочкиТочекАлгоритмов.Направление КАК Направление
	|ИЗ
	|	Справочник.бит_ТочкиАлгоритмов.ВходящиеТочки КАК ВходящиеТочкиТочекАлгоритмов
	|ГДЕ
	|	ВходящиеТочкиТочекАлгоритмов.Точка.ВидТочки = ЗНАЧЕНИЕ(Перечисление.бит_ВидыТочекАлгоритмов.Условие)
	|	И ВходящиеТочкиТочекАлгоритмов.ЗначениеУсловия = НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсходящиеТочкиТочекАлгоритмов.Ссылка,
	|	""ИсходящиеТочки"",
	|	ИсходящиеТочкиТочекАлгоритмов.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ИсходящиеТочкиТочекАлгоритмов.Направление = ЗНАЧЕНИЕ(Перечисление.бит_Направление.Горизонталь)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ИсходящиеТочкиТочекАлгоритмов.Направление
	|ИЗ
	|	Справочник.бит_ТочкиАлгоритмов.ИсходящиеТочки КАК ИсходящиеТочкиТочекАлгоритмов
	|ГДЕ
	|	ИсходящиеТочкиТочекАлгоритмов.Ссылка.ВидТочки = ЗНАЧЕНИЕ(Перечисление.бит_ВидыТочекАлгоритмов.Условие)
	|	И ИсходящиеТочкиТочекАлгоритмов.ЗначениеУсловия = НЕОПРЕДЕЛЕНО
	|ИТОГИ ПО
	|	ТочкаАлгоритма";
	
	ВыборкаТочекАлгоритма = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТочекАлгоритма.Следующий() Цикл
		ТочкаАлгоритма = ВыборкаТочекАлгоритма.ТочкаАлгоритма.ПолучитьОбъект();
		ВыборкаЗначенийУсловий = ВыборкаТочекАлгоритма.Выбрать();
		Пока ВыборкаЗначенийУсловий.Следующий() Цикл
			ИмяТабличнойЧасти = ВыборкаЗначенийУсловий.ТабличнаяЧасть;
			ИндексСтроки      = ВыборкаЗначенийУсловий.НомерСтроки - 1;
			ТочкаАлгоритма[ИмяТабличнойЧасти][ИндексСтроки].ЗначениеУсловия = ВыборкаЗначенийУсловий.ЗначениеУсловия;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТочкаАлгоритма);
	КонецЦикла;	

КонецПроцедуры

Процедура ПроверитьЗацикливаниеТочкиСлияния(ТочкаСлияния, ТекущаяТочка, Отказ, КэшПройденныхТочек = Неопределено, ЗафиксированныеТочки = Неопределено)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если КэшПройденныхТочек = Неопределено Тогда
		КэшПройденныхТочек = Новый Соответствие;
	ИначеЕсли КэшПройденныхТочек.Получить(ТекущаяТочка) = Истина Тогда
		// Проверка уже выполнялась
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ТекущаяТочка.ИсходящиеТочки Цикл
		Если ЗафиксированныеТочки = Неопределено Тогда
			ВышестоящиеТочки = Новый Соответствие;
		Иначе
			ВышестоящиеТочки = Новый Соответствие(ЗафиксированныеТочки);
		КонецЕсли;
		
		ИсходящаяТочка = СтрокаТаблицы.Точка;
		
		Если ИсходящаяТочка = ТочкаСлияния Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='Обнаружено зацикливание на точке ""%1"".';
											|en='Loop detected on point ""%1"".'"),
									   Строка(ТекущаяТочка));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ); 
			Прервать;
		КонецЕсли;
		
		Если ВышестоящиеТочки.Получить(ИсходящаяТочка) = Неопределено Тогда
			ВышестоящиеТочки.Вставить(ИсходящаяТочка, Истина);
		Иначе
			// Цикл за пределами проверяемой точки слияния. 
			Прервать;
		КонецЕсли;
		
		СтекПроверки = Новый ФиксированноеСоответствие(ВышестоящиеТочки);
		ПроверитьЗацикливаниеТочкиСлияния(ТочкаСлияния, ИсходящаяТочка, Отказ, КэшПройденныхТочек, СтекПроверки);
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
	КэшПройденныхТочек.Вставить(ТекущаяТочка, Истина);

КонецПроцедуры

Функция ТекстОшибкиЗаполнения(Представление, КодОшибки = 0, Пояснение = "")
	
	// 0 - недокументированная ошибка. Ожидается "пояснение".
	// 1 - несколько входящих,
	// 2 - несколько исходящих,
	// 3 - нет входящих,
	// 4 - нет исходящих,
	// 5 - неожиданные входящие точки,
	// 6 - неожиданные входящие точки,
	// 7 - точки обработки не поддерживаются алгоритмом.
	
	ТекстСообщения = "";
	ТекстОшибки    = НСтр("ru='Точка ""%1"" размещена некорректно. %2';
						  |en='Point ""%1"" placed incorrectly. %2'");
	
	Если КодОшибки = 1 Тогда
		ТекстСообщения = НСтр("ru='Несколько входящих связей доступны только в циклах поэтапных алгоритмов. Используйте точку слияния.';
							  |en='Several incoming links is not supported. Use the point of merger.'"); 
	ИначеЕсли КодОшибки = 2 Тогда	
		ТекстСообщения = НСтр("ru='Несколько исходящих связей не поддерживается. Используйте точку разделения.';
							  |en='Several outgoing links is not supported. Use the split point.'"); 
	ИначеЕсли КодОшибки = 3 Тогда	
		ТекстСообщения = НСтр("ru='Нет входящих связей.';en='No incoming connections.'");
	ИначеЕсли КодОшибки = 4 Тогда	
		ТекстСообщения = НСтр("ru='Нет исходящих связей.';en='No outbound connections.'");
	ИначеЕсли КодОшибки = 5 Тогда	
		ТекстСообщения = НСтр("ru='Входящие связи не поддерживаются.';en='Incoming communications are not supported.'");
	ИначеЕсли КодОшибки = 6 Тогда	
		ТекстСообщения = НСтр("ru='Исходящие связи не поддерживаются.';en='Outgoing communications are not supported.'");
	ИначеЕсли КодОшибки = 7 Тогда
		ТекстСообщения = НСтр("ru='Точки обработки не поддерживаются данным видом алгоритмов.';
							|en='Processing points are not supported by this type of algorithms.'");
	ИначеЕсли КодОшибки = 0 Тогда	
		ТекстСообщения = Пояснение;	
	КонецЕсли; 
	
	Возврат СтрШаблон(ТекстОшибки, Представление, ТекстСообщения);
	
КонецФункции

Функция ТочкиЗациклены(Точка1, Точка2, ИсходящиеТочки, СтекПроверки = Неопределено)
	
	Если СтекПроверки = Неопределено Тогда
		СтекПроверки = Новый Соответствие;
	КонецЕсли;
	Если СтекПроверки.Получить(Точка2) = Неопределено Тогда
		СтекПроверки.Вставить(Точка2, Ложь);
	Иначе
		// Внешний цикл не относящийся к проверяемым точкам.
		Возврат Ложь;
	КонецЕсли;
	
	Если Точка1 = Точка2 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Отбор = Новый Структура("ТочкаМаршрута", Точка2);
	СтрокиИсходищихТочек = ИсходящиеТочки.НайтиСтроки(Отбор);
	Для каждого СтрокаИсходящейТочки Из СтрокиИсходищихТочек Цикл
		ИсходящаяТочка = СтрокаИсходящейТочки.ИсходящаяТочка;
		Если ТочкиЗациклены(Точка1, ИсходящаяТочка, ИсходящиеТочки, СтекПроверки) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецЕсли
